void main() {
//======= List กลุ่มของข้อมูล 1ตัวแปลเก็บได้หลายค่า การเข้าถึงอ้าง index เริมที่ 0 ================ 062-8673667
//======= ขนาดยืดหยุ่นได้ กำหนดชนิดข้อมูลผ่าน <>
//=======  List ชื่อตัวแปร = ['ข้อมูล']               ชนิดข้อมูลต่างกันได้
//=======  List<ชนิดข้อมูล> ชื่อตัวแปร = ['ข้อมูล']      ชนิดข้อมูลต้องไม่ต่างกัน กำหนดชนิดข้อมูลเรียกว่า Generics เช่น List<int>
//=======  var ชื่อตัวแปร = ข้อมูล
//=======  List color= ["แดง","น้ำเงิน","เหลือง"]  การสร้าง List
//=======  var x = color.length;               ตรวจสอบจำนวน
//=======  var x1 = color.[0]                  อ้างถึงข้อมูลชุดแรก
//=======  var x1 = color.[color.length-1]     อ้างถึงข้อมูลชุดสุดท้าย
//=======  color.add("สีส้ม")                   เพิ่ม list
//=======  addAll(list)
//=======  insert(index,value)                  เพิ่มข้อมูลแทรกตำแหน่งที่ต้องการที่ละ 1 ตัว
//=======  insertAll(index,list)

  List<int> x = [10, 20, 30, 40, 50];
  print("x: $x");
  print("x => length: ${x.length}");
  print("x => index[2]: ${x[2]}");
  x.add(100);
  print('x: $x');
  x[0] = 1000;
  print('x: $x');

  print("========================");
  List y = [2, 5, 10, 20, 30];
  print("========================");
  print(y);
  print("========== ForEach  y ============");
  y.forEach((e) => print(e));
  print("======== Where  y e <= 20 =========");
  print(y.where( (e) => e <= 20));
  print("========================");
  for (var item in x) {
    print(item);
  }
  print("========================");
  var total = 0;
  for (var item in x) {
    total += item;
  }
  print("result $total");
}
